package advanced;

public class JianLiDemo {
    /**
     * 比较两个对象是否相同，解决复杂的的表达式处理
     * 一、Lenovo
     *
     * 2013年12月2015年3月      聚屏科技（北京）有限公司	 工作岗位：Java研发工程师
     * 价值体现
         创业产品开发
         * 参与创业项目视听节目网络数据采集系统从0到1的过程;
         * 参与公司转型探索，开发商用外包项目；
         * 曾在两周内自学并运用H5技术编写线上邀请函，交付给公司客户，为公司创造直接效益；
     *    创业公司的快速试错、快速切换运营模式，锻炼了快速学以致用的能力。
     * 个人成长
     *
     *
     *
     *
    2015年3月至11月      小普未来科技（深圳）有限公司    工作岗位：Java研发工程师
     价值体现
         在创业项目从0到1过程中，发挥了全栈工程师的作用，奠定了产品项目的后端雏形；
             完成架构调研与设计并搭建实施；
             持续沟通产品定位需求，抽象数据模型并不断完善；
             完成后端基础功能实现，完成部分用户界面编写；
             搭建持续集成环境，项目部署实施；
         

     个人成长
         对架构有过思考

    2016年1月至今				 联想（北京）有限公司 	 工作岗位：Java电子商务研发工程师
     价值与成长
         所负责业务模块新功能开发
             独自完成B2C业务欧洲国家站点与第三方订单管理系统集成并支持上线，完善了欧洲14个国家站点的B2C下单业务；
             支持了B2B大客户第三方采购系统集成的开发和线上问题的解决，为三百多个B2B大客户采购系统集成联想电商平台提供保障；
             完成B2C站点与内部LenovoID系统集成、与外部Facebook、Google、Msn第三方帐号登录集成，完善了用户帐号系统；
             多个业务模块功能的独立开发经历提高了业务分析与功能实现能力。
         所负责业务模块系统功能与性能维护
             解决所负责功能模块中超过40个线上bug，维护了所负责功能模块的系统稳定性；
             多个线上bug解决经历，提高了分析问题、定位问题以及解决问题的能力。
         其他
             开发过小工具用于提高工作流程效率。
     个人成长
        多个业务模块功能的独立开发经历提高了业务分析与功能实现能力；
        线上bug
        #拥有相对了规范化的敏捷工作经验；


     *
     * @param a
     * @param b
     * @return
     */
    public static boolean isEqual(Object a, Object b){
        if(a == null && b == null){
            return true;
        }
        if(a != null){
            return a.equals(b);
        }
        return b.equals(a);
    }
}
